---
kind: type
id: T:Autodesk.Revit.DB.AreaVolumeSettings
source: html/6282b3c9-3717-5c8f-7501-8a282244ce09.htm
---
# Autodesk.Revit.DB.AreaVolumeSettings

This class provides access to settings related to volume and area computations.

## Syntax (C#)
```csharp
public class AreaVolumeSettings : Element
```